# task 1
""" 
Порахувати кількість унікальних символів в строці. 
Якщо їх більше 10 - вивести в консоль True, інакше - False. 
""" 
def check_count_unique_symbols(str1):
    return len(set((str1).lower())) > 10


# task 2
"""
Є ліст з числами, порахуйте сумму усіх ПАРНИХ чисел в цьому лісті
"""
def sum_even_numbers(number_list):
    return sum(i for i in number_list if i % 2 == 0)


# task 3
"""  
Написати функцію, яка приймає два рядки та повертає індекс першого входження другого рядка
у перший рядок, якщо другий рядок є підрядком першого рядка, та -1, якщо другий рядок
не є підрядком першого рядка."""
def find_substring(str1, str2):
    return str1.find(str2)
