# task 01 == Виправте синтаксичні помилки
print("Hello", end=" ")
print("world!")

# task 02 == Виправте синтаксичні помилки
hello = "Hello"
world = "world"
if True:
    print(f"{hello} {world}!")

# task 03  == Вcтавте пропущену змінну у ф-цію print
for letter in "Hello world!":
    print(letter)

# task 04 == Зробіть так, щоб кількість бананів була
# завжди в чотири рази більша, ніж яблук
apples = 2
banana = apples * 4

# task 05 == виправте назви змінних
storona_1 = 1
storona_2 = 2
storona_3 = 3
storona_4 = 4

# task 06 == Порахуйте периметр фігури з task 05
# та виведіть його для користувача
perimetery = storona_1 + storona_2 + storona_3 + storona_4
print(f"Периметр фігури з task_05 складає {perimetery}.")

"""
    # Задачі 07 -10:
    # Переведіть задачі з книги "Математика, 2 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в другому класі
"""
# task 07
"""
У саду посадили 4 яблуні. Груш на 5 більше за яблунь, а слив - на 2 менше.
Скільки всього дерев посадили в саду?
"""
apples_tree = 4
pear_tree = apples_tree + 5
plum_tree = apples_tree - 2
trees_count = apples_tree + pear_tree + plum_tree
print(f"\nУ саду посадили {apples_tree} яблуні. Груш на 5 більше за яблунь, а слив - на 2 менше.")
print(f"Груш посадили {apples_tree} + 5 = {pear_tree}.")
print(f"Слив посадили {apples_tree} - 2 = {plum_tree}.")
print(f"Всього дерев посадили в саду {apples_tree} + {pear_tree} + {plum_tree} = {trees_count}.")

# task 08
"""
До обіда температура повітря була на 5 градусів вище нуля.
Після обіду температура опустилася на 10 градусів.
Надвечір потепліло на 4 градуси. Яка температура надвечір?
"""
temperature_1 = 5
temperature_2 = temperature_1 - 10
temperature_3 = temperature_2 + 4
print(f"\nДо обіда температура повітря була на {temperature_1} градусів вище нуля.")
print(f"Після обіду температура опустилася на 10 градусів і склала {temperature_1} - 10 = {temperature_2}.")
print(f"Надвечір потепліло на 4 градуси і температура повітря стала {temperature_2} + 4 = {temperature_3} градусів.")

# task 09
"""
Взагалі у театральному гуртку - 24 хлопчики, а дівчаток - вдвічі менше.
1 хлопчик захворів та 2 дівчинки не прийшли сьогодні.
Скількі сьогодні дітей у театральному гуртку?
"""
boys = 24
girls = int(boys / 2)
boys_today = boys - 1
girls_today = girls - 2
childen = boys_today + girls_today
print(f"\nВзагалі у театральному гуртку - {boys} хлопчики, а дівчаток - вдвічі менше.")
print(f"Тобто дівчат у гуртку {boys} / 2 = {girls}")
print(f"1 хлопчик захворів та 2 дівчинки не прийшли сьогодні.")
print(f"Сьогодні кількість дітей у театральному гуртку склала {boys} - 1 + {girls} - 2 = {childen}.")

# task 10
"""
Перша книжка коштує 8 грн., друга - на 2 грн. дороже,
а третя - як половина вартості першої та другої разом.
Скільки будуть коштувати усі книги, якщо купити по одному примірнику?
"""
book_1 = 8.0
book_2 = book_1 + 2
book_3 = (book_1 + book_2) / 2
total_cost = book_1 + book_2 + book_3
print(f"\nПерша книжка коштує {book_1} грн., друга - на 2 грн. дороже, а третя - як половина вартості першої та другої разом.")
print(f"Тобто вартість другої книги складає {book_1} + 2 = {book_2} грн.")
print(f"Вартість третьої книги складає ({book_1} + {book_2}) / 2 = {book_3} грн.")
print(f"В результаті {book_1} + {book_2} + {book_3} = {total_cost} грн. будуть коштувати усі книги, якщо купити по одному примірнику.")
