'''
My little SQLAlchemy
Створення моделі даних: Створіть просту модель даних для системи управління студентами. 
Модель може містити таблиці для студентів, курсів та їх відношень. Кожен студент може бути 
зареєстрований на декілька курсів. Наприклад, створити 5 курсів, та розподілити рандомно 20 студентів.
Виконання базових операцій: Напишіть програму, яка додає нового студента до бази даних та 
додає його до певного курсу. Переконайтеся, що ці зміни коректно відображаються у базі даних.
Запити до бази даних: Напишіть запити до бази даних, які повертають інформацію про студентів, 
зареєстрованих на певний курс, або курси, на які зареєстрований певний студент.
Оновлення та видалення даних: Реалізуйте можливість оновлення даних про студентів або курси, 
а також видалення студентів з бази даних.
Можна використовувати будь яку ORM на Ваш вібир.
'''
