class HomeIterator:
    numbers = [num for num in range(0, n + 1)]

    


# Генератори:
# Напишіть генератор, який повертає послідовність парних чисел від 0 до N.
# Створіть генератор, який генерує послідовність Фібоначчі до певного числа N.



# Ітератори:
# Реалізуйте ітератор для зворотного виведення елементів списку.
# Напишіть ітератор, який повертає всі парні числа в діапазоні від 0 до N.
def revert_iter(n):
    numbers = [num for num in range(0, n + 1)]
    for i in numbers:
        if i % 2 == 0:
            print(i)

revert_iter(5)

# Декоратори:
# Напишіть декоратор, який логує аргументи та результати викликаної функції.
# Створіть декоратор, який перехоплює та обробляє винятки, які виникають в ході виконання функції.